In [1]:
import sqlite3

In [2]:
# Create and Connect to the Databse 'Santhosh'

c = sqlite3.connect("MyDatabase")

In [3]:
# Delete Table from Data base 

c.execute('drop table if exists company')

In [4]:
# Create Table

c.execute('''create table company(ID INT PRIMARY KEY NOT NULL,NAME TEXT NOT NULL,AGE INT NOT NULL,ADDRESS CHAR(50),SALARY REAL NOT NULL)''')

In [5]:
print(c.execute('select * from company'))

<sqlite3.Cursor object at 0x000001A7F2BF79D0>

In [9]:
# Insert Data into table 'company'

c.execute("insert into company(ID,NAME,AGE,ADDRESS,salary) values(1,'Santhosh',32,'Nagarabhavi',140000)")

c.execute("insert into company(ID,Name,age,address,salary) values(2,'Anand',35,'Kengeri',160000)")

c.execute("insert into company(ID,name,age,address,salary) values(3,'Prashanth',34,'Hubli',145000)")

c.execute("INSERT INTO COMPANY VALUES(4,'SACHIN',35,'WhiteFIELD',110000)")

c.execute("INSERT INTO COMPANY(ID,NAME,AGE,ADDRESS,salary) VALUES(5,'Shreedevi',33,'Gulbarga',160000)")

c.execute("INSERT INTO COMPANY(ID,NAME,AGE,ADDRESS,salary) VALUES(6,'Harsha',31,'Belary',120000)")

In [10]:
c.commit # Commit the chnages made on the data base

In [11]:
[print(x) for x in c.execute("select * from company")]

(1, 'Santhosh', 32, 'Nagarabhavi', 140000.0)
(2, 'Anand', 35, 'Kengeri', 160000.0)
(3, 'Prashanth', 34, 'Hubli', 145000.0)
(4, 'SACHIN', 35, 'WhiteFIELD', 110000.0)
(5, 'Shreedevi', 33, 'Gulbarga', 160000.0)
(6, 'Harsha', 31, 'Belary', 120000.0)

[None, None, None, None, None, None]

In [17]:
# Get the count of the observation in the table

[print(x) for x in c.execute('select count(*) from company')]

(6,)

[None]

In [18]:
# Delete the row in the table

c.execute("delete from company where name ='SACHIN' ")

In [19]:
c.commit()

In [20]:
[x for x in c.execute('select count(*) from company')]

[(5,)]

In [21]:
c.execute("INSERT INTO COMPANY VALUES(4,'SACHIN',35,'WhiteFIELD',110000)")

c.commit()

In [22]:
[print(x) for x in c.execute("select * from company")]

(1, 'Santhosh', 32, 'Nagarabhavi', 140000.0)
(2, 'Anand', 35, 'Kengeri', 160000.0)
(3, 'Prashanth', 34, 'Hubli', 145000.0)
(5, 'Shreedevi', 33, 'Gulbarga', 160000.0)
(6, 'Harsha', 31, 'Belary', 120000.0)
(4, 'SACHIN', 35, 'WhiteFIELD', 110000.0)

[None, None, None, None, None, None]

In [25]:
# Get all the tables in database

In [26]:
# Drop table

c.execute("DROP TABLE COMPANY1")

OperationalError: no such table: COMPANY1

In [30]:
# SQLite - Boolean Expressions

[x for x in c.execute("select Name,ADDRESS,SALARY from company where 'SALARY'>130000")]

[('Santhosh', 'Nagarabhavi', 140000.0),
 ('Anand', 'Kengeri', 160000.0),
 ('Prashanth', 'Hubli', 145000.0),
 ('Shreedevi', 'Gulbarga', 160000.0),
 ('Harsha', 'Belary', 120000.0),
 ('SACHIN', 'WhiteFIELD', 110000.0)]

In [32]:
[x for x in c.execute("select * from company where salary = 110000")]

[(4, 'SACHIN', 35, 'WhiteFIELD', 110000.0)]

In [35]:
# SQLite - Numeric Expression

[x for x in c.execute("select (15+6) as addition")]

[(21,)]

In [38]:
[x for x in c.execute("SELECT COUNT(*) AS 'RECORDS' FROM COMPANY")]

[(6,)]

In [44]:
# Condition : And

[x for x in c.execute("select * from company where age>=33 and salary>140000")]

[(2, 'Anand', 35, 'Kengeri', 160000.0),
 (3, 'Prashanth', 34, 'Hubli', 145000.0),
 (5, 'Shreedevi', 33, 'Gulbarga', 160000.0)]

In [45]:
# Condition : or

[x for x in c.execute("select * from company where age>=33 or salary>140000")]

[(2, 'Anand', 35, 'Kengeri', 160000.0),
 (3, 'Prashanth', 34, 'Hubli', 145000.0),
 (5, 'Shreedevi', 33, 'Gulbarga', 160000.0),
 (4, 'SACHIN', 35, 'WhiteFIELD', 110000.0)]

In [48]:
# Condition : not NULL

[x for x in c.execute("Select * from company where age is not null")]

[(1, 'Santhosh', 32, 'Nagarabhavi', 140000.0),
 (2, 'Anand', 35, 'Kengeri', 160000.0),
 (3, 'Prashanth', 34, 'Hubli', 145000.0),
 (5, 'Shreedevi', 33, 'Gulbarga', 160000.0),
 (6, 'Harsha', 31, 'Belary', 120000.0),
 (4, 'SACHIN', 35, 'WhiteFIELD', 110000.0)]

In [50]:
# Condition : NULL

[x for x in c.execute("Select * from company where age is null")]

[]

In [52]:
# Condition : lists down all the records where NAME starts with 'Ki', does not matter what comes after 'sa'.

[x for x in c.execute("Select * from company where name like 'sa%' ")]

[(1, 'Santhosh', 32, 'Nagarabhavi', 140000.0),
 (4, 'SACHIN', 35, 'WhiteFIELD', 110000.0)]

In [61]:
# Condition : lists down all the records where NAME starts with 'Ki', does not matter what comes after 'sa'.

[x for x in c.execute("Select * from company where name GLOB 'sa*'")]

[]

In [62]:
# Condition : In

[x for x in c.execute("select * from company where age in(34,36)")]

[(3, 'Prashanth', 34, 'Hubli', 145000.0)]

In [63]:
# Condition : not In

[x for x in c.execute("select * from company where age not in(34,36)")]

[(1, 'Santhosh', 32, 'Nagarabhavi', 140000.0),
 (2, 'Anand', 35, 'Kengeri', 160000.0),
 (5, 'Shreedevi', 33, 'Gulbarga', 160000.0),
 (6, 'Harsha', 31, 'Belary', 120000.0),
 (4, 'SACHIN', 35, 'WhiteFIELD', 110000.0)]

In [68]:
# UPDATE Query is used to modify the existing records in a table. 

c.execute("update company set ADDRESS = 'Mysore'  where id =1")

[x for x in c.execute("select * from company")]

[(1, 'Santhosh', 32, 'Mysore', 140000.0),
 (2, 'Anand', 35, 'Kengeri', 160000.0),
 (3, 'Prashanth', 34, 'Hubli', 145000.0),
 (5, 'Shreedevi', 33, 'Gulbarga', 160000.0),
 (6, 'Harsha', 31, 'Belary', 120000.0),
 (4, 'SACHIN', 35, 'WhiteFIELD', 110000.0)]

In [70]:
c.execute("update company set address='Texas', salary = 130000")

[x for x in c.execute("select * from company")]

[(1, 'Santhosh', 32, 'Texas', 130000.0),
 (2, 'Anand', 35, 'Texas', 130000.0),
 (3, 'Prashanth', 34, 'Texas', 130000.0),
 (5, 'Shreedevi', 33, 'Texas', 130000.0),
 (6, 'Harsha', 31, 'Texas', 130000.0),
 (4, 'SACHIN', 35, 'Texas', 130000.0)]

In [76]:
# Delete all the rows of data in company

c.execute("delete from company")

[x for x in c.execute("select * from company")]

[]

In [77]:
# Insert Data


# Insert Data into table 'company'

c.execute("insert into company(ID,NAME,AGE,ADDRESS,salary) values(1,'Santhosh',32,'Nagarabhavi',140000)")

c.execute("insert into company(ID,Name,age,address,salary) values(2,'Anand',35,'Kengeri',160000)")

c.execute("insert into company(ID,name,age,address,salary) values(3,'Prashanth',34,'Hubli',145000)")

c.execute("INSERT INTO COMPANY VALUES(4,'SACHIN',35,'WhiteFIELD',110000)")

c.execute("INSERT INTO COMPANY(ID,NAME,AGE,ADDRESS,salary) VALUES(5,'Shreedevi',33,'Gulbarga',160000)")

c.execute("INSERT INTO COMPANY(ID,NAME,AGE,ADDRESS,salary) VALUES(6,'Harsha',31,'Belary',120000)")

c.commit()

In [78]:
[x for x in c.execute("select * from company")]

[(1, 'Santhosh', 32, 'Nagarabhavi', 140000.0),
 (2, 'Anand', 35, 'Kengeri', 160000.0),
 (3, 'Prashanth', 34, 'Hubli', 145000.0),
 (4, 'SACHIN', 35, 'WhiteFIELD', 110000.0),
 (5, 'Shreedevi', 33, 'Gulbarga', 160000.0),
 (6, 'Harsha', 31, 'Belary', 120000.0)]

In [80]:
# WHERE SALARY LIKE '200%' : Finds any values that start with 200

# WHERE SALARY LIKE '%200%' : Finds any values that have 200 in any position

# WHERE SALARY LIKE '_00%' : Finds any values that have 00 in the second and third positions

# WHERE SALARY LIKE '2_%_%' : Finds any values that start with 2 and are at least 3 characters in length

# WHERE SALARY LIKE '%2' : Finds any values that end with 2

# WHERE SALARY LIKE '_2%3' : Finds any values that has a 2 in the second position and ends with a 3

# WHERE SALARY LIKE '2___3' : Finds any values in a five-digit number that starts with 2 and ends with 3

In [86]:
[x for x in c.execute("select * from company where salary like '14%' ")]

[(1, 'Santhosh', 32, 'Nagarabhavi', 140000.0),
 (3, 'Prashanth', 34, 'Hubli', 145000.0)]

In [ ]:
# GLOB operator is used to match only text values against a pattern using wildcards

# The asterisk sign (*) : represents zero or multiple numbers or characters.

# The question mark (?) : represents a single number or character.

In [ ]:
# WHERE SALARY GLOB '200*' : Finds any values that start with 200

# WHERE SALARY GLOB '*200*' : Finds any values that have 200 in any position

# WHERE SALARY GLOB '?00*' : Finds any values that have 00 in the second and third positions

# WHERE SALARY GLOB '2??' : Finds any values that start with 2 and are at least 3 characters in length

# WHERE SALARY GLOB '*2' : Finds any values that end with 2

# WHERE SALARY GLOB '?2*3' : Finds any values that have a 2 in the second position and end with a 3

# WHERE SALARY GLOB '2???3' : Finds any values in a five-digit number that start with 2 and end with 3

# SELECT * FROM COMPANY WHERE AGE  GLOB '2*': display all the records from COMPANY table, where AGE starts with 2

# SELECT * FROM COMPANY WHERE ADDRESS  GLOB '*-*' :  which will display all the records from COMPANY table where ADDRESS will have a hyphen (-) inside the text

In [90]:
# Limit  clause is used both limit data amount returned by the select statment

[x for x in c.execute("select * from company limit 3")]

[(1, 'Santhosh', 32, 'Nagarabhavi', 140000.0),
 (2, 'Anand', 35, 'Kengeri', 160000.0),
 (3, 'Prashanth', 34, 'Hubli', 145000.0)]

In [93]:
# offset :  which picks up 2 records starting from the 4th position

[x for x in c.execute("select * from company limit 2 offset 3")]

[(4, 'SACHIN', 35, 'WhiteFIELD', 110000.0),
 (5, 'Shreedevi', 33, 'Gulbarga', 160000.0)]

In [94]:
# Order by

[x for x in c.execute("select * from company order by salary")]

[(4, 'SACHIN', 35, 'WhiteFIELD', 110000.0),
 (6, 'Harsha', 31, 'Belary', 120000.0),
 (1, 'Santhosh', 32, 'Nagarabhavi', 140000.0),
 (3, 'Prashanth', 34, 'Hubli', 145000.0),
 (2, 'Anand', 35, 'Kengeri', 160000.0),
 (5, 'Shreedevi', 33, 'Gulbarga', 160000.0)]

In [95]:
# Order by  : Assending

[x for x in c.execute("select * from company order by salary ASC")]

[(4, 'SACHIN', 35, 'WhiteFIELD', 110000.0),
 (6, 'Harsha', 31, 'Belary', 120000.0),
 (1, 'Santhosh', 32, 'Nagarabhavi', 140000.0),
 (3, 'Prashanth', 34, 'Hubli', 145000.0),
 (2, 'Anand', 35, 'Kengeri', 160000.0),
 (5, 'Shreedevi', 33, 'Gulbarga', 160000.0)]

In [97]:
# Order by  : Assending

[x for x in c.execute("select * from company order by salary DESC")]

[(2, 'Anand', 35, 'Kengeri', 160000.0),
 (5, 'Shreedevi', 33, 'Gulbarga', 160000.0),
 (3, 'Prashanth', 34, 'Hubli', 145000.0),
 (1, 'Santhosh', 32, 'Nagarabhavi', 140000.0),
 (6, 'Harsha', 31, 'Belary', 120000.0),
 (4, 'SACHIN', 35, 'WhiteFIELD', 110000.0)]

In [98]:
[x for x in c.execute("select * from company order by name,salary asc")]

[(2, 'Anand', 35, 'Kengeri', 160000.0),
 (6, 'Harsha', 31, 'Belary', 120000.0),
 (3, 'Prashanth', 34, 'Hubli', 145000.0),
 (4, 'SACHIN', 35, 'WhiteFIELD', 110000.0),
 (1, 'Santhosh', 32, 'Nagarabhavi', 140000.0),
 (5, 'Shreedevi', 33, 'Gulbarga', 160000.0)]

In [99]:
# Group by

[x for x in c.execute("select name,sum(salary) from company group by name order by name")]

[('Anand', 160000.0),
 ('Harsha', 120000.0),
 ('Prashanth', 145000.0),
 ('SACHIN', 110000.0),
 ('Santhosh', 140000.0),
 ('Shreedevi', 160000.0)]

In [101]:
c.execute("insert into company(ID,NAME,AGE,ADDRESS,salary) values(7,'Santhosh',32,'Nagarabhavi',140000)")

c.commit()

In [102]:
[x for x in c.execute("select * from company")]

[(1, 'Santhosh', 32, 'Nagarabhavi', 140000.0),
 (2, 'Anand', 35, 'Kengeri', 160000.0),
 (3, 'Prashanth', 34, 'Hubli', 145000.0),
 (4, 'SACHIN', 35, 'WhiteFIELD', 110000.0),
 (5, 'Shreedevi', 33, 'Gulbarga', 160000.0),
 (6, 'Harsha', 31, 'Belary', 120000.0),
 (7, 'Santhosh', 32, 'Nagarabhavi', 140000.0)]

In [104]:
# HAVING clause enables you to specify conditions that filter which group results appear in the final results.

[x for x in c.execute("select * from company group by name having count(name)>1")]

[(1, 'Santhosh', 32, 'Nagarabhavi', 140000.0)]

In [108]:
# DISTINCT keyword is used in SELECT statement to eliminate all the duplicate records and fetching only the unique records.

[x for x in c.execute("select name from company")]

[('Santhosh',),
 ('Anand',),
 ('Prashanth',),
 ('SACHIN',),
 ('Shreedevi',),
 ('Harsha',),
 ('Santhosh',)]

In [111]:
[x for x in c.execute("select distinct name from company")]

[('Santhosh',),
 ('Anand',),
 ('Prashanth',),
 ('SACHIN',),
 ('Shreedevi',),
 ('Harsha',)]

In [112]:
# Constraints:

# NOT NULL Constraint − Ensures that a column cannot have NULL value.

# DEFAULT Constraint − Provides a default value for a column when none is specified.

# UNIQUE Constraint − Ensures that all values in a column are different.

# PRIMARY Key − Uniquely identifies each row/record in a database table.

# CHECK Constraint − Ensures that all values in a column satisfies certain conditions.

In [113]:
#CREATE TABLE COMPANY(
#   ID INT PRIMARY KEY     NOT NULL,
#   NAME           TEXT    NOT NULL,
#   AGE            INT     NOT NULL UNIQUE,
#   ADDRESS        CHAR(50),
#   SALARY         REAL    DEFAULT 50000.00
#);

# CHECK Constraint
# SALARY REAL  CHECK(SALARY > 0)

In [115]:
# JOINS : Joins clause is used to combine records from two or more tables in a database. 

# The CROSS JOIN

# The INNER JOIN

# The OUTER JOIN

In [118]:
c.execute("CREATE TABLE COMPANY1(ID INT PRIMARY KEY NOT NULL,NAME TEXT NOT NULL,AGE INT NOT NULL,ADDRESS CHAR(50),SALARY REAL)")

In [120]:
c.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) VALUES (1, 'Paul', 32, 'California', 20000.00 )");

c.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

c.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

c.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

c.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) VALUES (5, 'David', 27, 'Texas', 85000.00 )");

c.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) VALUES (6, 'Kim', 22, 'South-Hall', 45000.00 )");

In [121]:
c.commit()

In [122]:
[x for x in c.execute("select * from company1")]

[(1, 'Paul', 32, 'California', 20000.0),
 (2, 'Allen', 25, 'Texas', 15000.0),
 (3, 'Teddy', 23, 'Norway', 20000.0),
 (4, 'Mark', 25, 'Rich-Mond ', 65000.0),
 (5, 'David', 27, 'Texas', 85000.0),
 (6, 'Kim', 22, 'South-Hall', 45000.0)]

In [125]:
# Create Another table 'Department'

c.execute("CREATE TABLE DEPARTMENT(ID INT PRIMARY KEY NOT NULL,DEPT CHAR(50) NOT NULL,EMP_ID INT NOT NULL)");

In [126]:
c.execute("INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID) VALUES (1, 'IT Billing', 1 )");

c.execute("INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID) VALUES (2, 'Engineering', 2 )");

c.execute("INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID) VALUES (3, 'Finance', 7 )");

In [127]:
c.commit()

In [128]:
[x for x in c.execute("select * from DEPARTMENT")]

[(1, 'IT Billing', 1), (2, 'Engineering', 2), (3, 'Finance', 7)]

In [131]:
[x for x in c.execute("select emp_id, name,DEPT from company1 cross join DEPARTMENT")]

[(1, 'Paul', 'IT Billing'),
 (2, 'Paul', 'Engineering'),
 (7, 'Paul', 'Finance'),
 (1, 'Allen', 'IT Billing'),
 (2, 'Allen', 'Engineering'),
 (7, 'Allen', 'Finance'),
 (1, 'Teddy', 'IT Billing'),
 (2, 'Teddy', 'Engineering'),
 (7, 'Teddy', 'Finance'),
 (1, 'Mark', 'IT Billing'),
 (2, 'Mark', 'Engineering'),
 (7, 'Mark', 'Finance'),
 (1, 'David', 'IT Billing'),
 (2, 'David', 'Engineering'),
 (7, 'David', 'Finance'),
 (1, 'Kim', 'IT Billing'),
 (2, 'Kim', 'Engineering'),
 (7, 'Kim', 'Finance')]

In [133]:
# Inner Join



[x for x in c.execute("select emp_id, name,dept from company1 inner join department on company1.id = department.id")]

[(1, 'Paul', 'IT Billing'),
 (2, 'Allen', 'Engineering'),
 (7, 'Teddy', 'Finance')]

In [134]:
# Outer Join

# LEFT OUTER JOIN

In [135]:
# Right OUTER JOIN

In [139]:
# ALIAS Syntax:

[x for x in c.execute("select c.id,c.name, c.age, d.dept from company1 as c,department as d where c.id = d.EMP_ID")]

[(1, 'Paul', 32, 'IT Billing'), (2, 'Allen', 25, 'Engineering')]

In [140]:
[x for x in c.execute("select c.id as company_id,c.name as company_name, c.age, d.dept from company1 as c,department as d where c.id = d.EMP_ID")]

[(1, 'Paul', 32, 'IT Billing'), (2, 'Allen', 25, 'Engineering')]

In [141]:
# Triggers : Triggers are database callback functions, which are automatically performed/invoked when a specified database event occurs.

In [ ]:
# ALter : SQLite ALTER TABLE command modifies an existing table

# You can rename a table using ALTER TABLE statement and additional columns can be added in an existing table using ALTER TABLE statement.

In [142]:
# Rename the table using alter

[x for x in c.execute("alter table company1 rename to old_company")]

[]

In [143]:
[x for x in c.execute("select * from old_company")]

[(1, 'Paul', 32, 'California', 20000.0),
 (2, 'Allen', 25, 'Texas', 15000.0),
 (3, 'Teddy', 23, 'Norway', 20000.0),
 (4, 'Mark', 25, 'Rich-Mond ', 65000.0),
 (5, 'David', 27, 'Texas', 85000.0),
 (6, 'Kim', 22, 'South-Hall', 45000.0)]

In [145]:
# Add column on the existing table

c.execute("alter table old_company add column sex char(1)")

In [147]:
[x for x in c.execute("select * from old_company")]

[(1, 'Paul', 32, 'California', 20000.0, None),
 (2, 'Allen', 25, 'Texas', 15000.0, None),
 (3, 'Teddy', 23, 'Norway', 20000.0, None),
 (4, 'Mark', 25, 'Rich-Mond ', 65000.0, None),
 (5, 'David', 27, 'Texas', 85000.0, None),
 (6, 'Kim', 22, 'South-Hall', 45000.0, None)]

In [148]:
# Truncate : not suppotred in in SQL Lites

In [ ]:
# Views : A view is nothing more than a SQLite statement that is stored in the database with an associated name.

In [159]:
c.execute("create view company_view2 as select id,name,age from old_company")

In [161]:
[x for x in c.execute("select * from company_view2")]

[(1, 'Paul', 32),
 (2, 'Allen', 25),
 (3, 'Teddy', 23),
 (4, 'Mark', 25),
 (5, 'David', 27),
 (6, 'Kim', 22)]

In [162]:
# Dropping Views :  DROP VIEW view_name;

In [163]:
# Subqueries with SELECT Statement

# Subqueries with INSERT Statement

# Subqueries with UPDATE Statement

# Subqueries with DELETE Statement

In [168]:
# AUTOINCREMENT is a keyword used for auto incrementing a value of a field in the table

c.execute("CREATE TABLE COMPANY3(ID INTEGER PRIMARY KEY AUTOINCREMENT,NAME TEXT NOT NULL,AGE INT NOT NULL,ADDRESS CHAR(50),SALARY REAL)")

In [171]:
c.execute("INSERT INTO COMPANY3 (NAME,AGE,ADDRESS,SALARY) VALUES ( 'Paul', 32, 'California', 20000.00 )")

c.execute("INSERT INTO COMPANY3 (NAME,AGE,ADDRESS,SALARY) VALUES ('Allen', 25, 'Texas', 15000.00 )")

c.execute("INSERT INTO COMPANY3 (NAME,AGE,ADDRESS,SALARY) VALUES ('Teddy', 23, 'Norway', 20000.00 )")

c.execute("INSERT INTO COMPANY3 (NAME,AGE,ADDRESS,SALARY) VALUES ( 'Mark', 25, 'Rich-Mond ', 65000.00 )")

c.execute("INSERT INTO COMPANY3 (NAME,AGE,ADDRESS,SALARY) VALUES ( 'David', 27, 'Texas', 85000.00 )")

c.execute("INSERT INTO COMPANY3 (NAME,AGE,ADDRESS,SALARY) VALUES ( 'Kim', 22, 'South-Hall', 45000.00 )")

c.execute("INSERT INTO COMPANY3 (NAME,AGE,ADDRESS,SALARY) VALUES ( 'James', 24, 'Houston', 10000.00 )");

In [172]:
[x for x in c.execute("select * from company3")]

[(1, 'Paul', 32, 'California', 20000.0),
 (2, 'Allen', 25, 'Texas', 15000.0),
 (3, 'Teddy', 23, 'Norway', 20000.0),
 (4, 'Mark', 25, 'Rich-Mond ', 65000.0),
 (5, 'David', 27, 'Texas', 85000.0),
 (6, 'Kim', 22, 'South-Hall', 45000.0),
 (7, 'James', 24, 'Houston', 10000.0)]